---
kind: method
id: M:Autodesk.Revit.UI.PulldownButtonData.#ctor(System.String,System.String)
source: html/a7c8e83c-d4d3-c22a-24b0-7d4b1a5b81ec.htm
---
# Autodesk.Revit.UI.PulldownButtonData.#ctor Method

Constructs a new instance of PulldownButtonData.

## Syntax (C#)
```csharp
public PulldownButtonData(
	string name,
	string text
)
```

## Parameters
- **name** (`System.String`) - The internal name of the new button.
- **text** (`System.String`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when Nothing nullptr a null reference ( Nothing in Visual Basic) is passed for one or more arguments.
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when an empty string is passed for one or more arguments.